# DistributionSysTypeSet Properties

---
The DistributionSysTypeSet type exposes the following members.
| Name| Description
---|---|---
| IsEmpty| Test to see if the set is empty.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Size| Returns the number of DistributionSys types that are in the set.
Top
#### Reference
DistributionSysTypeSet Class
Autodesk.Revit.DB.Electrical Namespace